import re

txt = 'The rain in London'
x = re.search('The.*London$' , txt)
print(x)

# найти все символи нижнего регистра в алфовитном порядке между 'a' и 'm'
# ________________________________________________________________________________________________________

txt = "The rain in Spain"
y = re.findall("[a-m]" , txt)
print(y)


# ________________________________________________________________________________________________________

txt = "That will be 59 dollars"

#найти все цыфровые символы (digit):

x = re.findall("\d", txt)
print(x)



# ________________________________________________________________________________________________________

txt = "hello planet"

#Найти последовательность, начинающуюся с «he», за которой следуют два (любых) символа и «о»:

x = re.findall("he..o", txt)
print(x)

# ________________________________________________________________________________________________________

txt = "hello planet"

#Проверяем, начинается ли строка с 'hello':

x = re.findall("^hello", txt)
if x:
  print("Yes, the string starts with 'hello'")
else:
  print("No match")


# ________________________________________________________________________________________________________

txt = "hello planet"

#Проверить, заканчивается ли строка на «planet»:

x = re.findall("planet$", txt)
if x:
  print("Yes, the string ends with 'planet'")
else:
  print("No match")


# ________________________________________________________________________________________________________

txt = "hello planet"

#Найти последовательность, начинающуюся с «he», за которой следует 0 или более (любых) символов и «о»:

x = re.findall("he.*o", txt)

print(x)

# ________________________________________________________________________________________________________

txt = "hello planet"

# Найдите последовательность, начинающуюся с «he», за которой следует 1 или более (любых) символов и «о»:

x = re.findall("he.+o", txt)

print(x)


# ________________________________________________________________________________________________________

txt = "hello planet"

#Найти последовательность, начинающуюся с «he», за которой следует 0 или 1 (любой) символ и «о»:

x = re.findall("he.?o", txt)

print(x)

#На этот раз мы не нашли совпадения, потому что между "he" и "o" было не ноль, не один, а два символа


# ________________________________________________________________________________________________________

txt = "hello planet"

#Найти последовательность, начинающуюся с «he», за которой следуют ровно 2 (любых) символа и «о»:
x = re.findall("he.{2}o", txt)

print(x)

# ________________________________________________________________________________________________________
txt = "The rain in Spain falls mainly in the plain!"

#Проверяем, есть ли в строке "falls" или "stays":

x = re.findall("falls|stays", txt)

print(x)

if x:
  print("Yes, there is at least one match!")
else:
  print("No match")
